# Cable Type Temperature Rating Property

Source: https://www.revitapidocs.com/2026/c395500d-e70a-71ec-d28a-40df8de79212.htm

---

| Cable Type Temperature Rating Property |
| --- |

The Conductor Temperature Rating of this Cable Type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId TemperatureRating { get; set; }
```

```
Public Property TemperatureRating As ElementId
	Get
	Set
```

```
public:
property ElementId^ TemperatureRating {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member TemperatureRating : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Temperature Rating id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace